chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_gpio.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_STM32F4XX_HAL_GPIO_H
#define _MOCK_STM32F4XX_HAL_GPIO_H

#include "unity.h"
#include "stm32f4xx.h"
#include "stm32f4xx_hal_def.h"
#include "stm32f4xx_hal_gpio.h"
#include "unity.h"
#include "CException.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic push
#endif
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

#ifdef __cplusplus
extern "C" {
#endif

void mock_stm32f4xx_hal_gpio_Init(void);
void mock_stm32f4xx_hal_gpio_Destroy(void);
void mock_stm32f4xx_hal_gpio_Verify(void);




#define HAL_GPIO_Init_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_Init requires _Ignore (not AndReturn)");
#define HAL_GPIO_Init_Ignore() HAL_GPIO_Init_CMockIgnore()
void HAL_GPIO_Init_CMockIgnore(void);
#define HAL_GPIO_Init_StopIgnore() HAL_GPIO_Init_CMockStopIgnore()
void HAL_GPIO_Init_CMockStopIgnore(void);
#define HAL_GPIO_Init_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_Init requires _ExpectAnyArgs (not AndReturn)");
#define HAL_GPIO_Init_ExpectAnyArgs() HAL_GPIO_Init_CMockExpectAnyArgs(__LINE__)
void HAL_GPIO_Init_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_Init_ExpectAndReturn(GPIOx, GPIO_Init, cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_Init requires _Expect (not AndReturn)");
#define HAL_GPIO_Init_Expect(GPIOx, GPIO_Init) HAL_GPIO_Init_CMockExpect(__LINE__, GPIOx, GPIO_Init)
void HAL_GPIO_Init_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init);
typedef void (* CMOCK_HAL_GPIO_Init_CALLBACK)(GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init, int cmock_num_calls);
void HAL_GPIO_Init_AddCallback(CMOCK_HAL_GPIO_Init_CALLBACK Callback);
void HAL_GPIO_Init_Stub(CMOCK_HAL_GPIO_Init_CALLBACK Callback);
#define HAL_GPIO_Init_StubWithCallback HAL_GPIO_Init_Stub
#define HAL_GPIO_Init_ExpectAndThrow(GPIOx, GPIO_Init, cmock_to_throw) HAL_GPIO_Init_CMockExpectAndThrow(__LINE__, GPIOx, GPIO_Init, cmock_to_throw)
void HAL_GPIO_Init_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, GPIO_InitTypeDef* GPIO_Init, CEXCEPTION_T cmock_to_throw);
#define HAL_GPIO_Init_ReturnThruPtr_GPIOx(GPIOx) HAL_GPIO_Init_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, sizeof(GPIO_TypeDef))
#define HAL_GPIO_Init_ReturnArrayThruPtr_GPIOx(GPIOx, cmock_len) HAL_GPIO_Init_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_len * sizeof(*GPIOx)))
#define HAL_GPIO_Init_ReturnMemThruPtr_GPIOx(GPIOx, cmock_size) HAL_GPIO_Init_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_size))
void HAL_GPIO_Init_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size);
#define HAL_GPIO_Init_ReturnThruPtr_GPIO_Init(GPIO_Init) HAL_GPIO_Init_CMockReturnMemThruPtr_GPIO_Init(__LINE__, GPIO_Init, sizeof(GPIO_InitTypeDef))
#define HAL_GPIO_Init_ReturnArrayThruPtr_GPIO_Init(GPIO_Init, cmock_len) HAL_GPIO_Init_CMockReturnMemThruPtr_GPIO_Init(__LINE__, GPIO_Init, (cmock_len * sizeof(*GPIO_Init)))
#define HAL_GPIO_Init_ReturnMemThruPtr_GPIO_Init(GPIO_Init, cmock_size) HAL_GPIO_Init_CMockReturnMemThruPtr_GPIO_Init(__LINE__, GPIO_Init, (cmock_size))
void HAL_GPIO_Init_CMockReturnMemThruPtr_GPIO_Init(UNITY_LINE_TYPE cmock_line, GPIO_InitTypeDef const* GPIO_Init, size_t cmock_size);
#define HAL_GPIO_Init_IgnoreArg_GPIOx() HAL_GPIO_Init_CMockIgnoreArg_GPIOx(__LINE__)
void HAL_GPIO_Init_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_Init_IgnoreArg_GPIO_Init() HAL_GPIO_Init_CMockIgnoreArg_GPIO_Init(__LINE__)
void HAL_GPIO_Init_CMockIgnoreArg_GPIO_Init(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_DeInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_DeInit requires _Ignore (not AndReturn)");
#define HAL_GPIO_DeInit_Ignore() HAL_GPIO_DeInit_CMockIgnore()
void HAL_GPIO_DeInit_CMockIgnore(void);
#define HAL_GPIO_DeInit_StopIgnore() HAL_GPIO_DeInit_CMockStopIgnore()
void HAL_GPIO_DeInit_CMockStopIgnore(void);
#define HAL_GPIO_DeInit_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_DeInit requires _ExpectAnyArgs (not AndReturn)");
#define HAL_GPIO_DeInit_ExpectAnyArgs() HAL_GPIO_DeInit_CMockExpectAnyArgs(__LINE__)
void HAL_GPIO_DeInit_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_DeInit_ExpectAndReturn(GPIOx, GPIO_Pin, cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_DeInit requires _Expect (not AndReturn)");
#define HAL_GPIO_DeInit_Expect(GPIOx, GPIO_Pin) HAL_GPIO_DeInit_CMockExpect(__LINE__, GPIOx, GPIO_Pin)
void HAL_GPIO_DeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin);
typedef void (* CMOCK_HAL_GPIO_DeInit_CALLBACK)(GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, int cmock_num_calls);
void HAL_GPIO_DeInit_AddCallback(CMOCK_HAL_GPIO_DeInit_CALLBACK Callback);
void HAL_GPIO_DeInit_Stub(CMOCK_HAL_GPIO_DeInit_CALLBACK Callback);
#define HAL_GPIO_DeInit_StubWithCallback HAL_GPIO_DeInit_Stub
#define HAL_GPIO_DeInit_ExpectAndThrow(GPIOx, GPIO_Pin, cmock_to_throw) HAL_GPIO_DeInit_CMockExpectAndThrow(__LINE__, GPIOx, GPIO_Pin, cmock_to_throw)
void HAL_GPIO_DeInit_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint32_t GPIO_Pin, CEXCEPTION_T cmock_to_throw);
#define HAL_GPIO_DeInit_ReturnThruPtr_GPIOx(GPIOx) HAL_GPIO_DeInit_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, sizeof(GPIO_TypeDef))
#define HAL_GPIO_DeInit_ReturnArrayThruPtr_GPIOx(GPIOx, cmock_len) HAL_GPIO_DeInit_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_len * sizeof(*GPIOx)))
#define HAL_GPIO_DeInit_ReturnMemThruPtr_GPIOx(GPIOx, cmock_size) HAL_GPIO_DeInit_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_size))
void HAL_GPIO_DeInit_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size);
#define HAL_GPIO_DeInit_IgnoreArg_GPIOx() HAL_GPIO_DeInit_CMockIgnoreArg_GPIOx(__LINE__)
void HAL_GPIO_DeInit_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_DeInit_IgnoreArg_GPIO_Pin() HAL_GPIO_DeInit_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_DeInit_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_ReadPin_Ignore() TEST_FAIL_MESSAGE("HAL_GPIO_ReadPin requires _IgnoreAndReturn");
#define HAL_GPIO_ReadPin_IgnoreAndReturn(cmock_retval) HAL_GPIO_ReadPin_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_GPIO_ReadPin_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_PinState cmock_to_return);
#define HAL_GPIO_ReadPin_StopIgnore() HAL_GPIO_ReadPin_CMockStopIgnore()
void HAL_GPIO_ReadPin_CMockStopIgnore(void);
#define HAL_GPIO_ReadPin_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_GPIO_ReadPin requires _ExpectAnyArgsAndReturn");
#define HAL_GPIO_ReadPin_ExpectAnyArgsAndReturn(cmock_retval) HAL_GPIO_ReadPin_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_GPIO_ReadPin_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_PinState cmock_to_return);
#define HAL_GPIO_ReadPin_Expect(GPIOx, GPIO_Pin) TEST_FAIL_MESSAGE("HAL_GPIO_ReadPin requires _ExpectAndReturn");
#define HAL_GPIO_ReadPin_ExpectAndReturn(GPIOx, GPIO_Pin, cmock_retval) HAL_GPIO_ReadPin_CMockExpectAndReturn(__LINE__, GPIOx, GPIO_Pin, cmock_retval)
void HAL_GPIO_ReadPin_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, GPIO_PinState cmock_to_return);
typedef GPIO_PinState (* CMOCK_HAL_GPIO_ReadPin_CALLBACK)(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, int cmock_num_calls);
void HAL_GPIO_ReadPin_AddCallback(CMOCK_HAL_GPIO_ReadPin_CALLBACK Callback);
void HAL_GPIO_ReadPin_Stub(CMOCK_HAL_GPIO_ReadPin_CALLBACK Callback);
#define HAL_GPIO_ReadPin_StubWithCallback HAL_GPIO_ReadPin_Stub
#define HAL_GPIO_ReadPin_ExpectAndThrow(GPIOx, GPIO_Pin, cmock_to_throw) HAL_GPIO_ReadPin_CMockExpectAndThrow(__LINE__, GPIOx, GPIO_Pin, cmock_to_throw)
void HAL_GPIO_ReadPin_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, CEXCEPTION_T cmock_to_throw);
#define HAL_GPIO_ReadPin_ReturnThruPtr_GPIOx(GPIOx) HAL_GPIO_ReadPin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, sizeof(GPIO_TypeDef))
#define HAL_GPIO_ReadPin_ReturnArrayThruPtr_GPIOx(GPIOx, cmock_len) HAL_GPIO_ReadPin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_len * sizeof(*GPIOx)))
#define HAL_GPIO_ReadPin_ReturnMemThruPtr_GPIOx(GPIOx, cmock_size) HAL_GPIO_ReadPin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_size))
void HAL_GPIO_ReadPin_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size);
#define HAL_GPIO_ReadPin_IgnoreArg_GPIOx() HAL_GPIO_ReadPin_CMockIgnoreArg_GPIOx(__LINE__)
void HAL_GPIO_ReadPin_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_ReadPin_IgnoreArg_GPIO_Pin() HAL_GPIO_ReadPin_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_ReadPin_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_WritePin_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_WritePin requires _Ignore (not AndReturn)");
#define HAL_GPIO_WritePin_Ignore() HAL_GPIO_WritePin_CMockIgnore()
void HAL_GPIO_WritePin_CMockIgnore(void);
#define HAL_GPIO_WritePin_StopIgnore() HAL_GPIO_WritePin_CMockStopIgnore()
void HAL_GPIO_WritePin_CMockStopIgnore(void);
#define HAL_GPIO_WritePin_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_WritePin requires _ExpectAnyArgs (not AndReturn)");
#define HAL_GPIO_WritePin_ExpectAnyArgs() HAL_GPIO_WritePin_CMockExpectAnyArgs(__LINE__)
void HAL_GPIO_WritePin_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_WritePin_ExpectAndReturn(GPIOx, GPIO_Pin, PinState, cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_WritePin requires _Expect (not AndReturn)");
#define HAL_GPIO_WritePin_Expect(GPIOx, GPIO_Pin, PinState) HAL_GPIO_WritePin_CMockExpect(__LINE__, GPIOx, GPIO_Pin, PinState)
void HAL_GPIO_WritePin_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState);
typedef void (* CMOCK_HAL_GPIO_WritePin_CALLBACK)(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState, int cmock_num_calls);
void HAL_GPIO_WritePin_AddCallback(CMOCK_HAL_GPIO_WritePin_CALLBACK Callback);
void HAL_GPIO_WritePin_Stub(CMOCK_HAL_GPIO_WritePin_CALLBACK Callback);
#define HAL_GPIO_WritePin_StubWithCallback HAL_GPIO_WritePin_Stub
#define HAL_GPIO_WritePin_ExpectAndThrow(GPIOx, GPIO_Pin, PinState, cmock_to_throw) HAL_GPIO_WritePin_CMockExpectAndThrow(__LINE__, GPIOx, GPIO_Pin, PinState, cmock_to_throw)
void HAL_GPIO_WritePin_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, GPIO_PinState PinState, CEXCEPTION_T cmock_to_throw);
#define HAL_GPIO_WritePin_ReturnThruPtr_GPIOx(GPIOx) HAL_GPIO_WritePin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, sizeof(GPIO_TypeDef))
#define HAL_GPIO_WritePin_ReturnArrayThruPtr_GPIOx(GPIOx, cmock_len) HAL_GPIO_WritePin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_len * sizeof(*GPIOx)))
#define HAL_GPIO_WritePin_ReturnMemThruPtr_GPIOx(GPIOx, cmock_size) HAL_GPIO_WritePin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_size))
void HAL_GPIO_WritePin_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size);
#define HAL_GPIO_WritePin_IgnoreArg_GPIOx() HAL_GPIO_WritePin_CMockIgnoreArg_GPIOx(__LINE__)
void HAL_GPIO_WritePin_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_WritePin_IgnoreArg_GPIO_Pin() HAL_GPIO_WritePin_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_WritePin_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_WritePin_IgnoreArg_PinState() HAL_GPIO_WritePin_CMockIgnoreArg_PinState(__LINE__)
void HAL_GPIO_WritePin_CMockIgnoreArg_PinState(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_TogglePin_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_TogglePin requires _Ignore (not AndReturn)");
#define HAL_GPIO_TogglePin_Ignore() HAL_GPIO_TogglePin_CMockIgnore()
void HAL_GPIO_TogglePin_CMockIgnore(void);
#define HAL_GPIO_TogglePin_StopIgnore() HAL_GPIO_TogglePin_CMockStopIgnore()
void HAL_GPIO_TogglePin_CMockStopIgnore(void);
#define HAL_GPIO_TogglePin_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_TogglePin requires _ExpectAnyArgs (not AndReturn)");
#define HAL_GPIO_TogglePin_ExpectAnyArgs() HAL_GPIO_TogglePin_CMockExpectAnyArgs(__LINE__)
void HAL_GPIO_TogglePin_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_TogglePin_ExpectAndReturn(GPIOx, GPIO_Pin, cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_TogglePin requires _Expect (not AndReturn)");
#define HAL_GPIO_TogglePin_Expect(GPIOx, GPIO_Pin) HAL_GPIO_TogglePin_CMockExpect(__LINE__, GPIOx, GPIO_Pin)
void HAL_GPIO_TogglePin_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin);
typedef void (* CMOCK_HAL_GPIO_TogglePin_CALLBACK)(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, int cmock_num_calls);
void HAL_GPIO_TogglePin_AddCallback(CMOCK_HAL_GPIO_TogglePin_CALLBACK Callback);
void HAL_GPIO_TogglePin_Stub(CMOCK_HAL_GPIO_TogglePin_CALLBACK Callback);
#define HAL_GPIO_TogglePin_StubWithCallback HAL_GPIO_TogglePin_Stub
#define HAL_GPIO_TogglePin_ExpectAndThrow(GPIOx, GPIO_Pin, cmock_to_throw) HAL_GPIO_TogglePin_CMockExpectAndThrow(__LINE__, GPIOx, GPIO_Pin, cmock_to_throw)
void HAL_GPIO_TogglePin_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, CEXCEPTION_T cmock_to_throw);
#define HAL_GPIO_TogglePin_ReturnThruPtr_GPIOx(GPIOx) HAL_GPIO_TogglePin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, sizeof(GPIO_TypeDef))
#define HAL_GPIO_TogglePin_ReturnArrayThruPtr_GPIOx(GPIOx, cmock_len) HAL_GPIO_TogglePin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_len * sizeof(*GPIOx)))
#define HAL_GPIO_TogglePin_ReturnMemThruPtr_GPIOx(GPIOx, cmock_size) HAL_GPIO_TogglePin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_size))
void HAL_GPIO_TogglePin_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size);
#define HAL_GPIO_TogglePin_IgnoreArg_GPIOx() HAL_GPIO_TogglePin_CMockIgnoreArg_GPIOx(__LINE__)
void HAL_GPIO_TogglePin_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_TogglePin_IgnoreArg_GPIO_Pin() HAL_GPIO_TogglePin_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_TogglePin_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_LockPin_Ignore() TEST_FAIL_MESSAGE("HAL_GPIO_LockPin requires _IgnoreAndReturn");
#define HAL_GPIO_LockPin_IgnoreAndReturn(cmock_retval) HAL_GPIO_LockPin_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_GPIO_LockPin_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_GPIO_LockPin_StopIgnore() HAL_GPIO_LockPin_CMockStopIgnore()
void HAL_GPIO_LockPin_CMockStopIgnore(void);
#define HAL_GPIO_LockPin_ExpectAnyArgs() TEST_FAIL_MESSAGE("HAL_GPIO_LockPin requires _ExpectAnyArgsAndReturn");
#define HAL_GPIO_LockPin_ExpectAnyArgsAndReturn(cmock_retval) HAL_GPIO_LockPin_CMockExpectAnyArgsAndReturn(__LINE__, cmock_retval)
void HAL_GPIO_LockPin_CMockExpectAnyArgsAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_GPIO_LockPin_Expect(GPIOx, GPIO_Pin) TEST_FAIL_MESSAGE("HAL_GPIO_LockPin requires _ExpectAndReturn");
#define HAL_GPIO_LockPin_ExpectAndReturn(GPIOx, GPIO_Pin, cmock_retval) HAL_GPIO_LockPin_CMockExpectAndReturn(__LINE__, GPIOx, GPIO_Pin, cmock_retval)
void HAL_GPIO_LockPin_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_GPIO_LockPin_CALLBACK)(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, int cmock_num_calls);
void HAL_GPIO_LockPin_AddCallback(CMOCK_HAL_GPIO_LockPin_CALLBACK Callback);
void HAL_GPIO_LockPin_Stub(CMOCK_HAL_GPIO_LockPin_CALLBACK Callback);
#define HAL_GPIO_LockPin_StubWithCallback HAL_GPIO_LockPin_Stub
#define HAL_GPIO_LockPin_ExpectAndThrow(GPIOx, GPIO_Pin, cmock_to_throw) HAL_GPIO_LockPin_CMockExpectAndThrow(__LINE__, GPIOx, GPIO_Pin, cmock_to_throw)
void HAL_GPIO_LockPin_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, CEXCEPTION_T cmock_to_throw);
#define HAL_GPIO_LockPin_ReturnThruPtr_GPIOx(GPIOx) HAL_GPIO_LockPin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, sizeof(GPIO_TypeDef))
#define HAL_GPIO_LockPin_ReturnArrayThruPtr_GPIOx(GPIOx, cmock_len) HAL_GPIO_LockPin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_len * sizeof(*GPIOx)))
#define HAL_GPIO_LockPin_ReturnMemThruPtr_GPIOx(GPIOx, cmock_size) HAL_GPIO_LockPin_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_size))
void HAL_GPIO_LockPin_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size);
#define HAL_GPIO_LockPin_IgnoreArg_GPIOx() HAL_GPIO_LockPin_CMockIgnoreArg_GPIOx(__LINE__)
void HAL_GPIO_LockPin_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_LockPin_IgnoreArg_GPIO_Pin() HAL_GPIO_LockPin_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_LockPin_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_EXTI_IRQHandler_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_EXTI_IRQHandler requires _Ignore (not AndReturn)");
#define HAL_GPIO_EXTI_IRQHandler_Ignore() HAL_GPIO_EXTI_IRQHandler_CMockIgnore()
void HAL_GPIO_EXTI_IRQHandler_CMockIgnore(void);
#define HAL_GPIO_EXTI_IRQHandler_StopIgnore() HAL_GPIO_EXTI_IRQHandler_CMockStopIgnore()
void HAL_GPIO_EXTI_IRQHandler_CMockStopIgnore(void);
#define HAL_GPIO_EXTI_IRQHandler_ExpectAnyArgsAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_EXTI_IRQHandler requires _ExpectAnyArgs (not AndReturn)");
#define HAL_GPIO_EXTI_IRQHandler_ExpectAnyArgs() HAL_GPIO_EXTI_IRQHandler_CMockExpectAnyArgs(__LINE__)
void HAL_GPIO_EXTI_IRQHandler_CMockExpectAnyArgs(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_EXTI_IRQHandler_ExpectAndReturn(GPIO_Pin, cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_EXTI_IRQHandler requires _Expect (not AndReturn)");
#define HAL_GPIO_EXTI_IRQHandler_Expect(GPIO_Pin) HAL_GPIO_EXTI_IRQHandler_CMockExpect(__LINE__, GPIO_Pin)
void HAL_GPIO_EXTI_IRQHandler_CMockExpect(UNITY_LINE_TYPE cmock_line, uint16_t GPIO_Pin);
typedef void (* CMOCK_HAL_GPIO_EXTI_IRQHandler_CALLBACK)(uint16_t GPIO_Pin, int cmock_num_calls);
void HAL_GPIO_EXTI_IRQHandler_AddCallback(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALLBACK Callback);
void HAL_GPIO_EXTI_IRQHandler_Stub(CMOCK_HAL_GPIO_EXTI_IRQHandler_CALLBACK Callback);
#define HAL_GPIO_EXTI_IRQHandler_StubWithCallback HAL_GPIO_EXTI_IRQHandler_Stub
#define HAL_GPIO_EXTI_IRQHandler_ExpectAndThrow(GPIO_Pin, cmock_to_throw) HAL_GPIO_EXTI_IRQHandler_CMockExpectAndThrow(__LINE__, GPIO_Pin, cmock_to_throw)
void HAL_GPIO_EXTI_IRQHandler_CMockExpectAndThrow(UNITY_LINE_TYPE cmock_line, uint16_t GPIO_Pin, CEXCEPTION_T cmock_to_throw);
#define HAL_GPIO_EXTI_IRQHandler_IgnoreArg_GPIO_Pin() HAL_GPIO_EXTI_IRQHandler_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_EXTI_IRQHandler_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);

#ifdef __cplusplus
}
#endif

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
